'number' + 3 + 3 // number33 -- string, конкатенація, приводить все до рядка

null + 3 // 3 -- number, "немає значення" + 3 - буде 3

5 && "qwerty" // qwerty -- перевірило чи всі значення true і вивело останнє

+'40' + +'2' + "hillel"; // 42hillel -- 40 і 2 привело до числа і виконало додавання, бо + перед ними, а далі конкатенація 

'10' - 5 === 6; // false -- строг

true + false // 1 -- тру рахує як 1, фолс як 0

'4px' - 3 // NaN -- нот а намбер, від строки не можна відняти 3

'4' - 3 // 1 -- намбер

'6' + 3 ** 0; // 61 -- 1) 3 ** 0 = 1 - зведення в ступінь; 2) приводить до рядка 61 ('6' + 1) 

12 / '6' // 2 -- виконується ділення

'10' + (5 === 6); // 10false -- 1) значення не рівні, тому false; 2) '10' + false - проводить до рядка

null == '' // false -- ці значення не перетворюються на інші типи, вони рівні один одному і не рівні будь-чому іншому

3 ** (9 / 3); // 27 -- 1) 9 / 3 = 3; 2) 3 ** 3 = 27

!!'false' == !!'true' // true -- все сприймається як текст

0 || '0' && 1 // 1 -- 1) '0' && 1 - поверне останнє true, виконується перше, бо пріоритет І (&&) вище за АБО (||) 2) або - виведе перше true, тобто 1

(+null == false) < 1; // false -- 1) +null == false буде true; 2) true < 1 - false

false && true || true // true -- 1) false && true буде false 2) false || true - поверне true

false && (false || true); // false -- 1) false || true поверне true 2) false && true буде false

(+null == false) < 1 ** 5; // false -- 1) +null == false буде true; 2) 1 ** 5 = 1; 3) true < 1 - false

